workstation/openfoam-master-tutorials/tutorials/heatTransfer/buoyantPimpleFoam/thermocoupleTestCase/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2306                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     buoyantPimpleFoam;

startFrom       latestTime;

startTime       0;

stopAt          endTime;

endTime         90;

deltaT          0.1;

writeControl    adjustable;

writeInterval   10;

purgeWrite      0;

writeFormat     ascii;

writePrecision  6;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable true;

adjustTimeStep  no;

maxCo           0.5;

functions
{
    probes
    {
        type            thermoCoupleProbes;
        libs            (utilityFunctionObjects);
        writeControl    timeStep;
        writeInterval   1;

        solver          rodas23;
        absTol          1e-12;
        relTol          1e-8;

        interpolationScheme cellPoint;

        // thermocouple properties
        rho             8908;
        Cp              440;
        d               1e-3;
        epsilon         0.85;
        radiationField  G;
        probeLocations  ((0.5 0.5 0.5));
        fields          (T);
    }
}


// ************************************************************************* //
